# Buttons

button-back = ◀️ Назад
button-next = Вперед ▶️
button-want = ХОЧУ!
button-account = 🌀 Аккаунт 🌀
button-catalogue = 📜 Каталог 📜
button-great = 👌 Отлично! 👌
button-take-it = БЕРУ!

# Messages

item-list = 📜 Список доступных товаров 📜

item-show = 🏷 { $name } 🏷

            🪙 { $sell_price } 🪙

item-info = Ты хочешь приобрести
            🏷 <b>{ $name }</b> 🏷

            { $category }
            { $description }

            🪙 <b>{ $sell_price }</b> 🪙
            Для оформления заказа нажми кнопку БЕРУ!
            Необходимо указать количество товара
            и адрес доставки.
            Оформленный заказ получит <b>менеджер</b>.
            Деньги с кошелька списываются после
            подтверждения <b>менеджером</b>

fill-count = Введи <b>Количество</b> товара

             Это должно быть <b>Число</b>

wrong-count = Введено неверное количество

too-large-count = Введено слишком большое количество!
                  На складе нет столько товара.

fill-address = Введи <b>Адрес доставки</b>

               Это может быть строка из букв, чисел и символов
               Если потребуется уточнение
               - на связь выйдет <b>менеджер</b>

wrong-address = Введен неверный адрес доставки

order-confirmation = Итоговая информация по заказу

                     🏷 <b>{ $count }</b> ✖️ { $name } 🏷
                     { $category }

                     { $description }

                     На сумму 🪙 <b>{ $total_sum }</b> 🪙
                     По цене  🪙 <b>{ $sell_price }</b> 🪙 за 1ед.

                     Покупатель: <b>{ $username }</b>
                     Адрес доставки:
                     { $address }

order-complete = Заказ №<code>{ $index }</code> от <code>{ $date_and_time }</code>
                 оформлен! Ожидай <b>Менеджера</b>.
                 Он напишет в личные сообщения.
                 Сохрани номер заказа и время его создания
                 если возникнут проблемы с заказом -
                 предоставь их <b>Менеджеру</b> для решения вопросов

                 Деньги с кошелька списываются после
                 подтверждения <b>менеджером</b>

order-notification = <b>Новый заказ!</b>
                     Зайди в Бота-Админа для его дальнейшей
                     обработки @здесьСсылкаНаБота

                     Информация по заказу:

                     Заказ № <b>{ $index }</b> от { $date_and_time }
                     ID Покупателя <code>{ $user_id }</code>
                     Username Покупателя <code>@{ $username }</code>
                     Адрес достакви:
                     <code>{ $delivery_address }</code>

                     <b>{ $count }</b> ✖️ { $name }
                     На сумму 🪙<b>{ $income }</b> 🪙
                     Чистая прибыль 🪙 <b>{ $pure_income }</b> 🪙

account-data = Аккаунт 🆔 <code>{ $user_id }</code>

               Сделано покупок 🛍: <b>{ $purchase }</b>
               На сумму 🪙: <b>{ $purchase_sum }</b> TOKEN
               Приглашено пользователей 😉: <b>{ $referrals }</b>

               Ссылка для приглашения 🤝:
               <code>{ $link }</code>

               Адрес кошелька 💳:
               <code>{ $address }</code>



