# Buttons

button-back = ◀️ Назад
button-next = Вперед ▶️
button-want = ХОЧУ!
button-account = 🌀 Аккаунт 🌀
button-catalogue = 📜 Каталог 📜
button-great = 👌 Отлично! 👌
button-referral = 🤝 Ввести RefCode 🤝

# Messages

refcode-complete = Пригласительный код успешно введен!
refcode-error = Пригласительный код неверный
                или ты приглашаешь себя!

                Введи правильный пригласительный код
                или нажми ◀️ Назад

nft-list = 📜 Список доступных товаров 📜

create-new = <b>Новый пользователь!</b>
             Для тебя создан кошелёк

             <code>{ $new_address }</code>

             Сохрани следующие <b>24</b> слова
             для восстановления аккаунта

             <code>{ $new_mnemonics }</code>

account-data = Аккаунт 🆔 <code>{ $user_id }</code>

               Сделано покупок 🛍: <b>{ $purchase }</b>
               На сумму 🪙: <b>{ $purchase_sum }</b> TOKEN
               Приглашено пользователей 😉: <b>{ $referrals }</b>

               Ссылка для приглашения 🤝:
               <code>{ $link }</code>

               Адрес кошелька 💳:
               <code>{ $address }</code>

already-invited = Ты уже использовал пригласительный Код!

                  Можешь пригласить по своему коду
                  <code>{ $refcode }</code>
                  Ты пригласил уже <b>{ $referrals }</b> пользователей

input-refcode =  Введи пригласительный код
                 и отправь сообщение

                 Код выглядит так:
                 <code>{ $refcode }</code>
                 (это <b>Твой</b> код)


