# Buttons

button-back = ◀️ Назад
button-next = Вперед ▶️
button-want = ХОЧУ!
button-account = 🌀 Аккаунт 🌀
button-catalogue = 📜 Каталог 📜
button-great = 👌 Отлично! 👌

# Messages

refcode-complete = Пригласительный код успешно введен!
refcode-error = Пригласительный код неверный
                или ты приглашаешь себя!

                Введи правильный пригласительный код
                или нажми ◀️ Назад

item-list = 📜 Список доступных товаров 📜

item-show = 📜 { $name } 📜

            🪙 { $sell_price } 🪙

create-new = <b>Новый пользователь!</b>
             Для тебя создан кошелёк

             <code>{ $new_address }</code>

             Сохрани следующие <b>24</b> слова
             для восстановления аккаунта

             <code>{ $new_mnemonics }</code>

account-data = Аккаунт 🆔 <code>{ $user_id }</code>

               Сделано покупок 🛍: <b>{ $purchase }</b>
               На сумму 🪙: <b>{ $purchase_sum }</b> TOKEN
               Приглашено пользователей 😉: <b>{ $referrals }</b>

               Ссылка для приглашения 🤝:
               <code>{ $link }</code>

               Адрес кошелька 💳:
               <code>{ $address }</code>



