# ####### #
# BUTTONS #
# ####### #

button-eth = ⭐️ ETHEREUM

button-sol = 🔥 SOLANA

button-trx = TRON 💥

button-ftm = ⚡️ FANTOM ⚡️

button-back = ◀️ Назад ◀️

button-account = 📑 Аккаунт 📑

# ######## #
# MESSAGES #
# ######## #

fill-eth-address = 💥 Привет <b>{ $name }</b>! 💥
                   
                   В этом боте ты можешь получать
                   🎁 БЕСПЛАТНО 🎁
                   <b>Ethereum Tron</b> и <b>Fantom</b>!
                   
                   Вот что нужно сделать: ввести свой адрес
                   ⭐️ <b>ETH</b> ⭐️ и отправить его сообщением  

fill-trx-address = Хорошо, введи адрес 💥 <b>TRX</b> 💥

fill-sol-address = Отлично!

                   А теперь, введи адрес 🔥 <b>SOL</b> 🔥

select-coin = 🔽    🔽    🔽
              Выбери монету, которую хочешь получить!
              Вывод может занять несколько минут...
            
              Один раз в <b>неделю</b> ты можешь получить на выбор:

              ⭐️ <b>{ $eth }</b> Ethereum ⭐️
              ⚡️ <b>{ $ftm }</b> Fantom ⚡️
              💥 <b>{ $trx }</b> Tron 💥

account = Твои адреса 💳 кошельков и дата последнего получения монет

          ⭐️ <b>ETH</b> ⭐️: <code>{ $eth_address }</code>
          (для получение FTM используется адрес ⭐️ <b>ETH</b> ⭐️)

          💥 <b>TRX</b> 💥: <code>{ $trx_address }</code>

          Последний раз ты забирал монеты:

          ⏳ <b>{ $last_get }</b> ⏳

success-eth = Успешный вывод ⭐️ <b>ETH</b> ⭐️!
              Hash транзакции:

              { $hash }

success-trx = Успешный вывод 💥 <b>TRX</b> 💥!
              ID транзакции:

              { $hash }

success-ftm = Успешный вывод ⚡️ <b>FTM</b> ⚡️!
              Hash транзакции:

              { $hash }

success-sol = Успешный вывод 🔥 <b>SOL</b> 🔥!
              Signature транзакции:
              { $hash }

error-central-balance = Ошибка центрального кошелька

error-lastget = Вывод можно совершать <b>1</b> раз в Неделю!

error-address = Неверный Адрес!

error-ethaddress = Неверный ⭐️ <b>ETH</b> ⭐️ адрес!

error-soladdress = Неверный 🔥 <b>SOL</b> 🔥 адрес!

error-trxaddress = Неверный 💥 <b>TRX</b> 💥 адрес!

wrong-input = Неверный ввод!

unknown-message = Не понял, что ты сказал...